IDEA Open Model
CombiItem Class
Compatible with IDEA StatiCa v 10.1
 Combi item
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Loading.CombiItem
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public class CombiItem : OpenObject
Public Class CombiItem
	Inherits OpenObject
public ref class CombiItem : public OpenObject
The CombiItem type exposes the following members.
Constructors
Name | Description
CombiItem
 Constructor
Top
Properties
Name | Description
Coeff
 Coefficient
Combination
 Inserted another combination
Id
 Id of CombiItem
LoadCase
 Load case
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace